{
  "backend/main.mo": "Defines core backend logic for users, conversations, messages, calls, and friendships with authorization and blob storage mixins.",
  "feature_evidence.json": "Lists implemented features, linked frontend files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color palettes and global styling.",
  "frontend/index.html": "HTML entry point loading the Inter font and mounting the React application at root.",
  "frontend/src/App.tsx": "Main React app wrapper handling onboarding, actor initialization, chat UI, and global call components.",
  "frontend/src/constants/branding.ts": "Exports the app name and tagline used across the UI.",
  "frontend/src/constants/buildInfo.ts": "Provides a build identifier based on an environment variable or document timestamp.",
  "frontend/src/features/auth/LoginView.tsx": "Deprecated login UI screen showing branding but no longer used in the app flow.",
  "frontend/src/features/auth/NameStartView.tsx": "Initial onboarding screen where users enter and save a display name before entering the app.",
  "frontend/src/features/calls/CallChip.tsx": "Renders a minimized call UI chip with peer info and mute/end controls, updating call status on the server when ending.",
  "frontend/src/features/calls/CallProvider.tsx": "Provides global call state and actions such as starting, receiving, minimizing, muting, and ending calls, including peer connection management.",
  "frontend/src/features/calls/CallScreen.tsx": "Implements the full call screen, handling local media, WebRTC setup, signaling, call initiation, and remote stream handling.",
  "frontend/src/features/calls/IncomingCallDialog.tsx": "Displays a modal dialog for incoming calls with caller info and accept/decline actions.",
  "frontend/src/features/calls/IncomingCallManager.tsx": "Polls for incoming calls, shows dialogs, and sets up WebRTC and backend updates when calls are accepted or declined.",
  "frontend/src/features/calls/useCallSignaling.ts": "Polls backend call sessions for status, offer, and answer updates, invoking callbacks when changes occur.",
  "frontend/src/features/calls/useIncomingCallPolling.ts": "Polls the backend for pending incoming calls and returns the list along with related metadata.",
  "frontend/src/features/calls/useLocalMedia.ts": "React hook to acquire and manage local audio/video media streams with error handling and cleanup logic.",
  "frontend/src/features/calls/webrtc.ts": "Utility functions for creating RTCPeerConnections, generating offers/answers, handling ICE, and managing local/remote streams.",
  "frontend/src/features/chat/ChatShell.tsx": "Main chat layout managing conversation selection, new chat dialog, and rendering the conversation list and message thread.",
  "frontend/src/features/chat/ConversationList.tsx": "Displays the user’s conversations with unread status, user lookup, and delete actions using backend query hooks.",
  "frontend/src/features/chat/FriendRequestsDialog.tsx": "Empty file.",
  "frontend/src/features/chat/MessageComposer.tsx": "Message input component supporting text, image upload with preview and progress, and sending messages via backend mutation.",
  "frontend/src/features/chat/MessageThread.tsx": "Renders messages for a conversation, marks them as read, auto-scrolls, and provides call initiation actions.",
  "frontend/src/features/chat/NewChatDialog.tsx": "Dialog component for searching users and starting new conversations with error handling and search filtering.",
  "frontend/src/features/chat/time.ts": "Utility functions to format message timestamps into relative or readable time strings.",
  "frontend/src/features/chat/useMessagePolling.ts": "Custom hook that periodically invalidates message and conversation queries for live updates.",
  "frontend/src/features/profile/AppInfoHelpDialog.tsx": "Dialog showing the current app URL, copy-to-clipboard, and cache-busting reload options.",
  "frontend/src/features/profile/ChangeDisplayNameDialog.tsx": "Dialog that updates the user's display name using a mutation and refreshes related queries.",
  "frontend/src/features/profile/DisplayNameOnboardingDialog.tsx": "Onboarding screen prompting new users to register a display name and create their profile.",
  "frontend/src/features/profile/ProfileMenu.tsx": "User profile dropdown providing access to display name changes and app info dialogs.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks to manage Internet Identity authentication using AuthClient, including login state and stored identities.",
  "frontend/src/hooks/useLocalActor.ts": "Creates a backend actor using a locally generated identity and initializes access control via a secret token.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for conversations, messages, user search, user lookup, and mutations like sending messages or starting conversations.",
  "frontend/src/index.css": "Sets Tailwind base styles and theme variables with OKLCH colors and layout adjustments including dark mode.",
  "frontend/src/lib/localIdentity.ts": "Handles generation, serialization, storage, and retrieval of a local Ed25519 identity in localStorage.",
  "frontend/src/lib/localProfile.ts": "Manages localStorage state for display names and onboarding completion flags.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH-based color palette, themes, animations, and plugins.",
  "project_state.json": "Defines the project’s state for a chat app, listing existing features, known issues, and pending feature requests. Highlights chat-start failures, auto-scroll improvements, and story/privacy additions."
}