{
  "backend/main.mo": "Defines messaging backend with users, conversations, calls, friendships, and integrated access control and blob storage.",
  "feature_evidence.json": "Lists feature evidence records mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for numerous frontend files used elsewhere in the project.",
  "frontend/index.css": "Tailwind base and theme definitions establishing light and dark OKLCH color tokens and global styling.",
  "frontend/index.html": "HTML entry point loading Inter font and bootstrapping the React application.",
  "frontend/src/App.tsx": "Main React app handling onboarding, identity setup, backend registration, and rendering ChatShell within QueryClient and CallProvider.",
  "frontend/src/constants/branding.ts": "Exports app name and tagline constants.",
  "frontend/src/constants/buildInfo.ts": "Provides build identifier derived from environment variable or document timestamp.",
  "frontend/src/features/auth/LoginView.tsx": "Deprecated login screen displaying branding and a message that it is no longer used.",
  "frontend/src/features/auth/NameStartView.tsx": "Name entry onboarding view saving display name locally and notifying parent to proceed.",
  "frontend/src/features/calls/CallChip.tsx": "Displays a minimized call widget showing peer info and controls for mute and hang up. Uses CallProvider state to restore or end the active call.",
  "frontend/src/features/calls/CallProvider.tsx": "Manages global call state including active session, mute status, and minimize/restore actions. Exposes hooks and context methods to start, end, and control calls.",
  "frontend/src/features/calls/CallScreen.tsx": "Renders the full call UI with video, error, and loading states. Integrates local media streams and provides controls to mute, minimize, or end the call.",
  "frontend/src/features/calls/useLocalMedia.ts": "Handles acquiring, managing, and cleaning up local audio/video media streams with error normalization. Provides utilities to enable/disable audio and clean up tracks.",
  "frontend/src/features/chat/ChatShell.tsx": "Defines the main chat layout containing the conversation list and message thread. Manages conversation selection and opening the new chat dialog.",
  "frontend/src/features/chat/ConversationList.tsx": "Lists user conversations with unread indicators and deletion support. Loads conversations and user data, rendering selectable conversation items.",
  "frontend/src/features/chat/FriendRequestsDialog.tsx": "Empty file with no implemented content.",
  "frontend/src/features/chat/MessageComposer.tsx": "Message composer UI for sending text and optional images with validation, preview, and upload progress.",
  "frontend/src/features/chat/MessageThread.tsx": "Displays a conversation thread, loads messages with polling, marks them read, and shows the composer.",
  "frontend/src/features/chat/NewChatDialog.tsx": "Dialog for searching users and starting new conversations with error handling.",
  "frontend/src/features/chat/time.ts": "Utility functions for formatting timestamps into relative or time-of-day strings.",
  "frontend/src/features/chat/useMessagePolling.ts": "Hook that periodically invalidates queries to refresh messages and conversation metadata.",
  "frontend/src/features/profile/AppInfoHelpDialog.tsx": "Dialog showing app URL, copy/reload tools, and cache‑refresh instructions.",
  "frontend/src/features/profile/ChangeDisplayNameDialog.tsx": "Dialog for updating the user’s display name using a mutation and invalidating related queries.",
  "frontend/src/features/profile/DisplayNameOnboardingDialog.tsx": "UI dialog for entering and saving a display name, registering via local actor and completing onboarding.",
  "frontend/src/features/profile/ProfileMenu.tsx": "Profile dropdown showing user info with options to change name and view app help dialogs.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, state, and stored identities.",
  "frontend/src/hooks/useLocalActor.ts": "Initializes a backend actor using a locally generated identity and sets up access control.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for conversations, messages, users, and mutations like sending messages or starting conversations.",
  "frontend/src/index.css": "Tailwind CSS config defining light/dark themes, variables, and message bubble styles.",
  "frontend/src/lib/localIdentity.ts": "Utility functions to generate, store, load, and clear locally persisted Ed25519 identities.",
  "frontend/src/lib/localProfile.ts": "Provides helpers to store, retrieve, and clear display name and onboarding state in localStorage.",
  "frontend/src/lib/utils.ts": "Exports a utility that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Offers utilities for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes, colors, animations, and including plugins like typography and container queries.",
  "project_state.json": "JSON tracking project metadata, features, issues, and requirements for ongoing work."
}