{
  "backend/main.mo": "Main backend canister implementing users, conversations, messages with image blobs, calls, and a friend system using access control and storage mixins.",
  "backend/migration.mo": "Migration module converting old conversations/messages into new versions that include an optional image field.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference in build planning.",
  "frontend/index.css": "Global Tailwind-based styling defining OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React application.",
  "frontend/src/App.tsx": "Main React app coordinating onboarding, local identity setup, backend registration, and rendering chat UI within providers.",
  "frontend/src/constants/branding.ts": "Exports branding constants for the app name and tagline.",
  "frontend/src/features/auth/LoginView.tsx": "Deprecated login view showing branding and a notice that it is no longer used.",
  "frontend/src/features/auth/NameStartView.tsx": "Collects and saves a user display name during onboarding and triggers completion via a callback.",
  "frontend/src/features/calls/CallChip.tsx": "Shows a minimized call UI with peer info, mute toggle, and end-call controls.",
  "frontend/src/features/calls/CallProvider.tsx": "Provides global call state including active call data, mute status, and minimize/restore actions.",
  "frontend/src/features/calls/CallScreen.tsx": "Displays the full call interface, handling video/audio stream setup, mute sync, errors, and minimize/end actions.",
  "frontend/src/features/calls/useLocalMedia.ts": "Manages acquiring and releasing local media streams, handling errors, and enabling/disabling audio tracks.",
  "frontend/src/features/chat/ChatShell.tsx": "Main chat layout managing conversation selection, dialogs, friend requests, and embedding call UI elements.",
  "frontend/src/features/chat/ConversationList.tsx": "Renders a scrollable list of conversations with unread state, selection handling, and participant display. Loads conversations and user data, showing placeholders when loading or empty.",
  "frontend/src/features/chat/FriendRequestsDialog.tsx": "Displays pending friend requests in a dialog with accept and decline actions. Fetches requestor profiles and triggers mutations with feedback to the user.",
  "frontend/src/features/chat/MessageComposer.tsx": "Provides a text and image message composer with validation, upload progress, and send handling. Sends messages via mutation and supports image preview and clearing.",
  "frontend/src/features/chat/MessageThread.tsx": "Shows messages for a conversation with auto-scroll, read-status updates, and call initiation. Loads user profiles, handles friend requests, and embeds the MessageComposer.",
  "frontend/src/features/chat/NewChatDialog.tsx": "Searches for users to start new chats, showing friend status and allowing starting conversations or sending friend requests. Filters results and triggers mutations with feedback.",
  "frontend/src/features/chat/time.ts": "Provides utilities for formatting timestamps into relative time and message time strings. Converts nanosecond timestamps into readable formats.",
  "frontend/src/features/chat/useMessagePolling.ts": "Implements polling to periodically refresh messages, conversations, and unread state for an active conversation. Uses react-query to invalidate relevant queries.",
  "frontend/src/features/profile/ChangeDisplayNameDialog.tsx": "Dialog component allowing users to update their display name using a mutation and invalidating related queries.",
  "frontend/src/features/profile/DisplayNameOnboardingDialog.tsx": "Onboarding UI for new users to register a display name and trigger onboarding completion.",
  "frontend/src/features/profile/ProfileMenu.tsx": "Profile dropdown menu showing user info and providing access to the change-display-name dialog.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to Internet Identity, invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login, stored identities, and login status.",
  "frontend/src/hooks/useLocalActor.ts": "Hook that loads or creates a local identity and initializes a backend actor with access control.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for conversations, messages, user search, user fetching, and message-related mutations.",
  "frontend/src/index.css": "Sets Tailwind layers and defines light/dark theme color variables plus message bubble component styles.",
  "frontend/src/lib/localIdentity.ts": "Manages Ed25519 identities including generation, serialization, storage, loading, and clearing from localStorage.",
  "frontend/src/lib/localProfile.ts": "Handles display name and onboarding flags in localStorage with getters, setters, and clear functions.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging Tailwind and clsx class names.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for extracting, storing, and persisting URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors tied to CSS variables, extended theme settings, and additional plugins.",
  "project_state.json": "Describes project goals, features, issues, and image-generation requirements for the YGLSUP app."
}