{
  "backend/main.mo": "Main canister actor implementing users, conversations, messages, calls, and friendships with storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their purpose and recent behavior changes.",
  "frontend/index.css": "Global Tailwind-based styles defining light/dark theme color tokens and applying base layout rules.",
  "frontend/index.html": "HTML entry point setting up metadata, fonts, and root container for the frontend app.",
  "frontend/src/App.tsx": "Main app component handling initialization, error recovery, onboarding flow, and rendering the chat and call UI.",
  "frontend/src/constants/branding.ts": "Exports application name and tagline branding constants.",
  "frontend/src/constants/buildInfo.ts": "Provides a build identifier sourced from environment variables or document metadata.",
  "frontend/src/features/auth/LoginView.tsx": "Deprecated login screen retained for compatibility and no longer used in the app flow.",
  "frontend/src/features/auth/NameStartView.tsx": "Onboarding component for capturing and storing a user's display name before entering the app.",
  "frontend/src/features/calls/CallChip.tsx": "Renders a minimized call control chip with peer info and mute/end actions, updating server call status on end.",
  "frontend/src/features/calls/CallDiagnostics.tsx": "Displays a diagnostics panel showing call status, direction, call ID state, and any signaling errors.",
  "frontend/src/features/calls/CallProvider.tsx": "Implements context for managing active call session state, mute/minimize behavior, and peer connection lifecycle.",
  "frontend/src/features/calls/CallScreen.tsx": "Handles full in-call UI, media acquisition, WebRTC setup, signaling, and backend call lifecycle updates.",
  "frontend/src/features/calls/IncomingCallDialog.tsx": "Shows a dialog for accepting or declining an incoming voice or video call with caller details.",
  "frontend/src/features/calls/IncomingCallManager.tsx": "Polls for incoming calls, shows the incoming call dialog, and handles acceptance with WebRTC answer flow.",
  "frontend/src/features/calls/useCallSignaling.ts": "React hook that watches a call session and triggers callbacks when status, offer, or answer change.",
  "frontend/src/features/calls/useIncomingCallPolling.ts": "Polls the backend for pending incoming calls on an interval with retry handling.",
  "frontend/src/features/calls/useLocalMedia.ts": "Manages acquiring, toggling, and cleaning up local audio/video MediaStreams with detailed error handling.",
  "frontend/src/features/calls/webrtc.ts": "Utility functions for creating and managing RTCPeerConnections, offers, answers, and media tracks.",
  "frontend/src/features/chat/ChatShell.tsx": "Main chat layout that manages conversation selection, friend request dialog, and new chat dialog state.",
  "frontend/src/features/chat/ConversationList.tsx": "Renders the user’s conversations, marking unread items and allowing selection or deletion.",
  "frontend/src/features/chat/FriendRequestsDialog.tsx": "Dialog listing pending friend requests with accept/decline actions and user info loading.",
  "frontend/src/features/chat/MessageComposer.tsx": "Provides a message composer UI allowing text and image messages with previews and upload progress, sending via mutation.",
  "frontend/src/features/chat/MessageThread.tsx": "Displays a conversation thread with messages, auto-scrolling, read marking, and call-starting actions.",
  "frontend/src/features/chat/NewChatDialog.tsx": "Implements a dialog for searching users, managing friendship actions, and starting new conversations.",
  "frontend/src/features/chat/time.ts": "Utility functions for formatting message timestamps into relative or readable time strings.",
  "frontend/src/features/chat/useMessagePolling.ts": "Sets up periodic polling to refresh messages, conversations, and unread status for a conversation.",
  "frontend/src/features/init/InitErrorScreen.tsx": "Renders an initialization error UI with summaries, contextual guidance, technical details, and retry/reset actions.",
  "frontend/src/features/init/resetLocalAppData.ts": "Clears all locally stored identity, profile, and session data for a full app reset.",
  "frontend/src/features/init/sanitizeInitError.ts": "Sanitizes initialization errors by removing sensitive info, classifying error types, and generating safe summaries.",
  "frontend/src/features/profile/AppInfoHelpDialog.tsx": "Dialog showing app URL, build info, diagnostics, and copy/refresh controls.",
  "frontend/src/features/profile/ChangeDisplayNameDialog.tsx": "Dialog for updating the user display name with mutation, validation, and UI feedback.",
  "frontend/src/features/profile/DisplayNameOnboardingDialog.tsx": "Onboarding screen allowing new users to set and register a display name.",
  "frontend/src/features/profile/ProfileMenu.tsx": "Profile dropdown showing user info and actions including name change, app info, and sign out.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provider and hook for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useLocalActor.ts": "Initializes a backend actor using a locally stored identity, performs health checks, and optionally applies an admin token with detailed error handling.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for conversations, messages, user search, messaging actions, and other backend interactions via the local actor.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles and a light/dark OKLCH color theme with layout and safe‑area adjustments.",
  "frontend/src/lib/localIdentity.ts": "Handles generation, serialization, loading, and cleanup of an Ed25519 identity in localStorage.",
  "frontend/src/lib/localProfile.ts": "Manages display name and onboarding completion state in localStorage.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and session parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining color tokens, themes, animations, and plugin setup.",
  "project_state.json": "Project state file describing schema version, issues, and implemented features related to startup initialization and admin-token handling."
}