{
  "backend/main.mo": "Main Motoko actor managing users, conversations, messages, calls, friendships, and authorization/storage mixins.",
  "backend/migration.mo": "Migration module converting old call sessions by adding isActive based on call status.",
  "feature_evidence.json": "Feature evidence report listing call-related frontend files, components, and test IDs for two major call features.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend source files for reference in build planning.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens, dark mode variables, and layout resets.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React application root.",
  "frontend/src/App.tsx": "Root React component initializing local identity, onboarding, chat UI, and global call system providers.",
  "frontend/src/constants/branding.ts": "Exports core branding strings for app name and tagline.",
  "frontend/src/constants/buildInfo.ts": "Defines a build identifier that updates each frontend build.",
  "frontend/src/features/auth/LoginView.tsx": "Deprecated login screen kept for compatibility, displaying static branding.",
  "frontend/src/features/auth/NameStartView.tsx": "Onboarding view allowing users to set their display name and trigger completion callback.",
  "frontend/src/features/calls/CallChip.tsx": "Displays a minimized floating call control UI with mute, end, and restore actions and updates call status on the server.",
  "frontend/src/features/calls/CallProvider.tsx": "Provides context for managing active call state, mute/minimize controls, peer connection, and lifecycle cleanup.",
  "frontend/src/features/calls/CallScreen.tsx": "Implements the full call UI, handling local/remote media setup, WebRTC signaling, and backend call status updates.",
  "frontend/src/features/calls/IncomingCallDialog.tsx": "Renders a modal dialog for incoming calls with accept and decline actions.",
  "frontend/src/features/calls/IncomingCallManager.tsx": "Polls for incoming calls, shows the incoming call dialog, and handles accepting or declining by setting up WebRTC and updating the backend.",
  "frontend/src/features/calls/useCallSignaling.ts": "Polls the backend for call session updates and notifies listeners of status, offer, or answer changes.",
  "frontend/src/features/calls/useIncomingCallPolling.ts": "Periodically fetches pending incoming calls from the backend for detection and UI handling.",
  "frontend/src/features/calls/useLocalMedia.ts": "Custom React hook managing audio/video acquisition, cleanup, and error handling. Provides media stream state and controls like toggling audio and cleanup.",
  "frontend/src/features/calls/webrtc.ts": "Utility functions to create and manage RTCPeerConnection, offers/answers, ICE gathering, and local/remote media streams.",
  "frontend/src/features/chat/ChatShell.tsx": "Top-level chat layout managing conversation selection, new chat dialog, and rendering conversation list or message thread.",
  "frontend/src/features/chat/ConversationList.tsx": "Displays user conversations with unread indicators, selection handling, and per-conversation delete actions.",
  "frontend/src/features/chat/FriendRequestsDialog.tsx": "Empty placeholder file for a friend‑requests dialog.",
  "frontend/src/features/chat/MessageComposer.tsx": "Message input component supporting text, image upload with preview and progress, and sending messages to a conversation.",
  "frontend/src/features/chat/MessageThread.tsx": "Renders messages for a conversation, handles read status, auto-scroll, polling, and provides call-starting actions.",
  "frontend/src/features/chat/NewChatDialog.tsx": "Modal for searching users and starting new conversations, including filtering, loading states, and error toasts.",
  "frontend/src/features/chat/time.ts": "Utility functions to format timestamps into relative or readable message times.",
  "frontend/src/features/chat/useMessagePolling.ts": "Hook that periodically invalidates message and conversation queries to refresh data for an active conversation.",
  "frontend/src/features/profile/AppInfoHelpDialog.tsx": "Dialog showing app URL, copy functionality, cache‑busting reload, and update troubleshooting tips.",
  "frontend/src/features/profile/ChangeDisplayNameDialog.tsx": "Dialog for updating a user's display name with mutation handling and query invalidation.",
  "frontend/src/features/profile/DisplayNameOnboardingDialog.tsx": "Onboarding screen allowing new users to set and register a display name.",
  "frontend/src/features/profile/ProfileMenu.tsx": "Profile menu with user initials, name display, and options for changing name or viewing app info.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on authentication state, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, loading saved identities, and tracking login status.",
  "frontend/src/hooks/useLocalActor.ts": "Creates a backend actor using a locally generated identity and initializes access control with an admin token.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching conversations, messages, users, and performing messaging-related mutations.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines light/dark theme variables using OKLCH colors.",
  "frontend/src/lib/localIdentity.ts": "Manages generating, serializing, storing, loading, and clearing a local Ed25519 identity in localStorage.",
  "frontend/src/lib/localProfile.ts": "Handles storing and clearing display name and onboarding state in localStorage.",
  "frontend/src/lib/utils.ts": "Exports a classnames utility combining clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL or session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, typography, animations, and plugins using OKLCH variables.",
  "project_state.json": "Defines the current project state, listing known call-related issues, existing features, and pending feature requests focused on fixing WebRTC signaling and call lifecycle behavior."
}