{
  "kind": "build_request",
  "title": "Fix app startup “Initialization Failed” by hardening actor initialization and admin-token handling",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Prevent actor initialization from failing due to missing/empty or invalid admin token values by making admin-token initialization optional and non-fatal in all actor initialization paths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "Initialisation failed fix"
        ]
      },
      "acceptanceCriteria": [
        "When no caffeineAdminToken is present, the app does not throw during actor initialization.",
        "When caffeineAdminToken is present but invalid, the app shows a clear error state (InitErrorScreen) instead of hanging or crashing.",
        "`frontend/src/hooks/useActor.ts` no longer calls `_initializeAccessControlWithSecret` with an empty string token.",
        "`frontend/src/hooks/useLocalActor.ts` treats `_initializeAccessControlWithSecret` errors as initialization errors with a sanitized message."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve the initialization error UX so the user can reliably recover from initialization failures caused by authorization/token issues (and not just generic network errors).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "Initialisation failed fix"
        ]
      },
      "acceptanceCriteria": [
        "InitErrorScreen displays an English summary that distinguishes authorization/token failures from network failures using the existing `sanitizeInitError` mechanism.",
        "If the sanitized error indicates authorization failure, the screen includes user-facing guidance in English (e.g., that access is not authorized and the user may need to retry or reset local data) without exposing any secrets.",
        "Retry and Reset actions remain functional and do not leave the app stuck on an indefinite “Initializing...” state."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a lightweight backend health-check method that does not require user permissions, and use it during frontend initialization to detect unreachable-canister vs authorization failures more accurately.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "Initialisation failed fix"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a new query method (e.g., `health()`/`ping()`) that returns a simple value and does not require `#user` permission.",
        "`useLocalActor` (or the main initialization flow in `App.tsx`) calls the health-check after actor creation and surfaces failures via `initError` so the InitErrorScreen appears instead of the UI proceeding into broken/unauthorized states.",
        "With the canister reachable, initialization proceeds past the loading screen; with the canister unreachable, the user sees InitErrorScreen with a network-related summary."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (read-only).",
    "Do not edit immutable hook files listed by the platform (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts` is editable, but do not modify any paths listed as immutable in SYSTEM_CONTEXT).",
    "Keep all Motoko logic in the single actor `backend/main.mo`; only add a migration file if persistent state schema changes."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is allowed).",
    "Adding external databases or non-IC backend services.",
    "Implementing real-time messaging via WebSockets."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}