{
  "kind": "build_request",
  "title": "Fix chat start failures and auto-scroll to newest messages",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the “Failed to start chat / Failed to chat” issue by making conversation IDs consistent across backend and frontend: (a) update the backend ConversationMetadata returned by getConversations() to include the canonical conversation id field, and (b) update the frontend to use that id everywhere (selecting a conversation, fetching messages, unread checks), instead of reconstructing IDs from participants.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Hey When Cllick on chat after clicking on Add friend name It's showing Failed to chat problem solve it"
        ]
      },
      "acceptanceCriteria": [
        "Backend getConversations() returns metadata that includes the canonical conversationId used as the key in the conversations map.",
        "Frontend no longer builds conversationId strings via `${user1}-${user2}`; it uses the id from backend metadata for selection, unread status checks, delete, and message fetching.",
        "Selecting a conversation from the list reliably loads messages (no 'Conversation not found' traps) regardless of principal ordering.",
        "Unread badge status matches backend getUnreadConversations() results."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Prevent startConversation from deleting/resetting an existing conversation: if a conversation already exists for the two users, return the existing conversationId without overwriting the stored conversation record/messages/lastSeen.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "When Cllick on chat after clicking on Add friend name It's showing Failed to chat problem solve it"
        ]
      },
      "acceptanceCriteria": [
        "Calling startConversation() multiple times for the same pair of users does not clear previous messages or lastSeen state.",
        "Starting a chat with a user you already have a conversation with consistently returns the same conversationId and preserves history."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement reliable automatic scrolling to the latest message in the chat thread when new messages arrive (including messages received via polling). Ensure the scroll is applied to the actual scrollable viewport used by the ScrollArea component.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Another problem while chatting when new Message comes then automatically Scroll screen to new messages"
        ]
      },
      "acceptanceCriteria": [
        "When a new message arrives in an open conversation, the message thread scrolls to reveal the latest message automatically.",
        "Auto-scroll works consistently with the current ScrollArea-based layout (i.e., it scrolls the visible viewport, not a non-scrollable inner div).",
        "Auto-scroll does not throw errors when there are zero messages or during loading transitions."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Improve the user-facing error shown when starting a chat fails so it reflects backend failure reasons (e.g., “Can only start conversations with friends”) instead of only showing a generic “Failed to start conversation”. All user-facing text must be English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "It's showing Failed to chat problem solve it"
        ]
      },
      "acceptanceCriteria": [
        "If startConversation fails due to friendship not being accepted, the toast/error displayed to the user clearly states they must be friends to chat (in English).",
        "Generic fallback error remains for unexpected failures."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add/adjust backend/migration.mo if state migration is strictly required.",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend.immutablePaths (compose them instead)."
  ],
  "nonGoals": [
    "Do not implement WhatsApp-like Status/Stories, story privacy controls, or any new social feed features in this change set.",
    "Do not change authentication mechanisms (Internet Identity/local identity) as part of these fixes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}