{
  "kind": "build_request",
  "title": "Add conversation deletion and resolve call feature issues",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a delete-conversation capability so a user can delete a 1:1 chat with a person, removing the conversation (and its messages) from the conversation list.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Give option to delete person chat"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a new authenticated method that deletes a conversation by ConversationId and rejects callers who are not a participant.",
        "Deleting a conversation removes it from subsequent getConversations() results and makes getMessages(conversationId) fail with a clear error (e.g., \"Conversation not found\").",
        "Frontend provides a clear UI affordance to delete a conversation from the conversation list (e.g., a menu/action per conversation item) with a confirmation step in English (e.g., \"Delete chat? This will remove the conversation and messages.\").",
        "After a successful deletion, the conversation list refreshes and if the deleted conversation was currently selected, the message thread view is cleared (no stale messages shown).",
        "If deletion fails (unauthorized/not found), the UI shows an English error toast/message and does not remove the conversation locally."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix all call-related issues by auditing and correcting the end-to-end call lifecycle (initiate, ringing/in-progress, minimize/restore, mute/unmute, and end) so calls do not get stuck, leak media devices, or leave the UI in an inconsistent state.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "And fix all issue related to calls"
        ]
      },
      "acceptanceCriteria": [
        "Starting a voice call and a video call from the message thread reliably opens the full-screen call UI without throwing runtime errors.",
        "Ending a call always stops and releases all acquired media tracks (microphone/camera) and returns the UI to the non-call state (no CallScreen, no CallChip).",
        "Minimize/restore works consistently: minimizing shows CallChip; restoring hides CallChip and shows CallScreen; neither action causes duplicated media acquisition or multiple parallel streams.",
        "Mute/unmute correctly affects the microphone track state for the current call and stays in sync between CallScreen and CallChip.",
        "If media permissions are denied or devices are unavailable, the CallScreen shows a clear English error state and the user can end the call from that screen.",
        "Backend call session state is consistent for both participants (no sessions stuck in #ringing/#inProgress after one side ends); ending a call transitions the session to an ended state and updates endTime.",
        "Frontend handles backend call initiation failures (including friendship-related failures) with an English error toast and resets any “initiating call” loading state."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Do not add any new friend-request feature or new friend-request UI entry points as part of this change set.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Hey don't add friend request option now"
        ]
      },
      "acceptanceCriteria": [
        "No new friend-request actions, dialogs, buttons, routes, or backend methods are introduced beyond what already exists.",
        "Any changes made while implementing chat deletion or call fixes do not expand friend-request functionality."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not modify frontend files under frontend/src/components/ui or any path listed in frontend.immutablePaths.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing a new friend request option or additional friend-request flows.",
    "Group chats or multi-participant conversations.",
    "Real-time calling via WebSockets/Socket.io (not supported)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}