{
  "kind": "build_request",
  "title": "Fix voice/video call feature not working in production",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the outgoing call WebRTC/signaling flow so that the same RTCPeerConnection used to generate the SDP offer is the one that later applies the SDP answer, and ensure the backend-stored offer/answer lifecycle results in a connected call between two different users.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Everything is good but call feature not working"
        ]
      },
      "acceptanceCriteria": [
        "From a 1:1 chat thread, User A can start a voice call to User B and the call transitions from initiated/ringing to inProgress after User B accepts.",
        "The SDP offer generated by the caller is stored on the backend call session and is the offer used by the callee to create an answer.",
        "When the callee answers (answer SDP stored on backend), the caller applies that answer on the same RTCPeerConnection that created the offer (no mismatched peer connections).",
        "If the call is ended by either party, the backend call status becomes ended and both clients exit the call UI."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix incoming call detection end-to-end in production by ensuring the backend exposes a working getPendingIncomingCalls() query for the authenticated user and that it returns only actionable incoming calls (e.g., initiated/ringing where caller != callee) so the frontend polling can reliably show the incoming call dialog.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Everything is good but call feature not working"
        ]
      },
      "acceptanceCriteria": [
        "Backend method getPendingIncomingCalls() exists and returns call sessions where the current caller is the callee and status indicates the call is awaiting a response (initiated or ringing, per the backend’s lifecycle).",
        "Calling getPendingIncomingCalls() does not trap for an authenticated user and does not return calls that are already ended/missed/inProgress.",
        "With two users, when User A starts a call to User B, User B sees the in-app incoming call UI within the polling interval."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Align backend call lifecycle semantics with the frontend call flow by enforcing consistent and valid status transitions for startCall, answerCall, and updateCallStatus, including correct status after answering and protection against invalid transitions by non-participants.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Everything is good but call feature not working"
        ]
      },
      "acceptanceCriteria": [
        "startCall(callee, kind, offer) creates a call session with caller, callee, offer set, answer empty, and a status that causes the callee to see it as incoming (e.g., ringing/initiated).",
        "answerCall(callId, answer) persists the answer SDP and results in a status that the caller can treat as ready to connect (typically inProgress or a clearly documented intermediate state that the frontend already handles).",
        "Only call participants (caller or callee) can read a call session via getCallSession(callId) and can mutate it via answerCall/updateCallStatus; non-participants are rejected.",
        "The backend does not allow nonsensical transitions (e.g., ended -> inProgress) and maintains endTime when a call is ended/missed."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Improve call failure visibility on the frontend so users and developers can diagnose why calls fail in production (permissions, backend traps, signaling missing offer/answer) without changing any immutable hook files.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Everything is good but call feature not working"
        ]
      },
      "acceptanceCriteria": [
        "If startCall/answerCall/updateCallStatus/getCallSession/getPendingIncomingCalls fail, the UI surfaces an English error message (toast or in-call error screen) and logs the underlying error to console for debugging.",
        "If microphone/camera permissions are denied, the call UI displays a clear error state and offers an End Call action.",
        "No changes are made to frontend immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add backend/migration.mo only if an upgrade requires state migration.",
    "Do not edit any frontend files under paths listed in SYSTEM_CONTEXT.frontend.immutablePaths; compose existing UI components instead.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding third-party TURN/STUN services or external signaling servers beyond the existing Internet Computer backend polling approach.",
    "Implementing real-time signaling via WebSockets or push notifications (not supported).",
    "Adding new authentication providers beyond Internet Identity."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}