{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Conversation deletion UI + stabilized call UI lifecycle",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Provide a conversation deletion action with confirmation, error handling, and correct UI refresh/selection clearing.",
      "acceptanceCriteria": [
        "Frontend provides a clear UI affordance to delete a conversation from the conversation list (e.g., a menu/action per conversation item) with a confirmation step in English (e.g., \"Delete chat? This will remove the conversation and messages.\").",
        "After a successful deletion, the conversation list refreshes and if the deleted conversation was currently selected, the message thread view is cleared (no stale messages shown).",
        "If deletion fails (unauthorized/not found), the UI shows an English error toast/message and does not remove the conversation locally."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query mutation hook for the existing backend capability deleteConversation(conversationId), and on success invalidate cached conversation list + unread list + messages for the deleted conversation; on error surface the thrown message to callers for toast rendering."
        },
        {
          "path": "frontend/src/features/chat/ConversationList.tsx",
          "operation": "modify",
          "description": "Add a per-conversation delete action (e.g., an icon button on each row) that triggers an English confirmation prompt before calling the delete mutation; ensure the action does not trigger row selection; show English toast errors via the existing toast system when deletion fails; do not modify any files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/chat/ChatShell.tsx",
          "operation": "modify",
          "description": "Wire conversation deletion into app state: pass a callback from ChatShell into ConversationList so that after a successful deletion the conversations query is refreshed and selectedConversationId is cleared when it matches the deleted conversation, ensuring MessageThread unmounts and no stale messages remain."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Audit and correct the call UI lifecycle to prevent stuck states, duplicated media acquisition, and inconsistent minimize/restore/mute/end behavior.",
      "acceptanceCriteria": [
        "Starting a voice call and a video call from the message thread reliably opens the full-screen call UI without throwing runtime errors.",
        "Ending a call always stops and releases all acquired media tracks (microphone/camera) and returns the UI to the non-call state (no CallScreen, no CallChip).",
        "Minimize/restore works consistently: minimizing shows CallChip; restoring hides CallChip and shows CallScreen; neither action causes duplicated media acquisition or multiple parallel streams.",
        "Mute/unmute correctly affects the microphone track state for the current call and stays in sync between CallScreen and CallChip.",
        "If media permissions are denied or devices are unavailable, the CallScreen shows a clear English error state and the user can end the call from that screen.",
        "Frontend handles backend call initiation failures (including friendship-related failures) with an English error toast and resets any “initiating call” loading state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/chat/ChatShell.tsx",
          "operation": "modify",
          "description": "Change call UI wiring so CallScreen remains mounted whenever there is an active call (even when minimized) while controlling its visibility based on minimize state; this prevents media re-acquisition when minimizing/restoring and keeps CallChip/CallScreen toggling consistent."
        },
        {
          "path": "frontend/src/features/calls/CallScreen.tsx",
          "operation": "modify",
          "description": "Update CallScreen to support the new minimize/restore lifecycle: keep media active while minimized (component mounted) but render nothing (or a non-intrusive state) when minimized; ensure end-call always triggers media cleanup by transitioning local media options to disabled when the call ends; keep mute state syncing between context and media tracks; ensure English error state remains actionable with an end-call control."
        },
        {
          "path": "frontend/src/features/chat/MessageThread.tsx",
          "operation": "modify",
          "description": "Harden call initiation to avoid runtime errors and stuck 'initiating call' state: guard against missing/unavailable backend call initiation capability, show an English error toast when initiation is not possible, and always clear the local initiating/loading flag on any failure path (including friendship-related failures)."
        },
        {
          "path": "frontend/src/features/calls/CallProvider.tsx",
          "operation": "modify",
          "description": "Audit and adjust call state transitions to ensure end/minimize/restore/mute produce a single consistent source of truth (no leftover minimized/muted state after ending, and no way to enter an inconsistent UI state when starting a new call while another is active)."
        },
        {
          "path": "frontend/src/features/calls/useLocalMedia.ts",
          "operation": "modify",
          "description": "Audit media acquisition/cleanup to ensure tracks are not leaked and are not duplicated across minimize/restore; confirm cleanup is invoked exactly once per acquired stream and that audio track enabled state changes stay consistent with mute toggles."
        },
        {
          "path": "frontend/src/features/calls/CallChip.tsx",
          "operation": "modify",
          "description": "Verify CallChip controls remain in sync with the shared call state (mute/unmute, end, restore) under the updated lifecycle; ensure actions do not create duplicate media acquisition and that end removes both CallChip and CallScreen reliably."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure changes do not introduce any new friend-request features or UI entry points while implementing deletion and call fixes.",
      "acceptanceCriteria": [
        "No new friend-request actions, dialogs, buttons, routes, or backend methods are introduced beyond what already exists.",
        "Any changes made while implementing chat deletion or call fixes do not expand friend-request functionality."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/chat/MessageThread.tsx",
          "operation": "modify",
          "description": "Keep existing friend-request UI unchanged while touching call initiation code paths; ensure any refactors for call lifecycle do not add new friend-request actions, buttons, or flows (only preserve existing behavior and text)."
        }
      ]
    }
  ]
}