{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Chat reliability fixes: canonical conversation IDs, viewport auto-scroll, and better start-chat errors",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Stop reconstructing conversation IDs on the frontend; use the canonical conversationId returned by backend conversation metadata for selection, unread checks, deletion, and message fetching.",
      "acceptanceCriteria": [
        "Frontend no longer builds conversationId strings via `${user1}-${user2}`; it uses the id from backend metadata for selection, unread status checks, delete, and message fetching.",
        "Selecting a conversation from the list reliably loads messages (no 'Conversation not found' traps) regardless of principal ordering.",
        "Unread badge status matches backend getUnreadConversations() results."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/chat/ConversationList.tsx",
          "operation": "modify",
          "description": "Update conversation rendering to use `conversation.conversationId` from `ConversationMetadata` as the list key, selection id, delete id, and unread check id (instead of reconstructing from participants). Keep `participants` usage only for computing the other user. Uses shadcn-ui ScrollArea for list scrolling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/chat/MessageThread.tsx",
          "operation": "modify",
          "description": "Remove reliance on parsing `conversationId` with `split('-')` to derive the other user. Resolve the active conversation's participants from fetched conversation metadata (e.g., via the existing conversations query) and derive the other participant principal from that metadata so it works with canonical IDs. Uses shadcn-ui ScrollArea for thread scrolling; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure any chat-related hooks and query keys consistently treat `ConversationId` as an opaque canonical id (no string composition assumptions) and that call sites can access `ConversationMetadata.conversationId` for UI state."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Implement reliable auto-scroll to the latest message by scrolling the actual ScrollArea viewport when new messages arrive (including via polling).",
      "acceptanceCriteria": [
        "When a new message arrives in an open conversation, the message thread scrolls to reveal the latest message automatically.",
        "Auto-scroll works consistently with the current ScrollArea-based layout (i.e., it scrolls the visible viewport, not a non-scrollable inner div).",
        "Auto-scroll does not throw errors when there are zero messages or during loading transitions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/chat/MessageThread.tsx",
          "operation": "modify",
          "description": "Rework auto-scroll to target the ScrollArea's scrollable viewport (not the inner content wrapper). Implement a safe scroll-to-bottom routine triggered on new messages (and after loading transitions), guarding against empty state and missing refs. Uses shadcn-ui ScrollArea; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/chat/useMessagePolling.ts",
          "operation": "modify",
          "description": "Ensure polling-triggered message refreshes reliably trigger the auto-scroll behavior in the open thread (without adding new routes). Keep invalidations consistent with canonical conversationId usage."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Show user-friendly English start-chat failure errors reflecting backend failure reasons (e.g., must be friends) with a generic fallback.",
      "acceptanceCriteria": [
        "If startConversation fails due to friendship not being accepted, the toast/error displayed to the user clearly states they must be friends to chat (in English).",
        "Generic fallback error remains for unexpected failures."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/chat/NewChatDialog.tsx",
          "operation": "modify",
          "description": "Improve startConversation error handling by mapping known backend failure messages to clear English toasts (e.g., \"You must be friends to start a chat.\") and keeping a generic fallback for unknown errors. Uses shadcn-ui Dialog/Input/Button components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Optionally normalize startConversation error propagation (without changing authentication) so UI can reliably read backend error messages and decide whether to show a friend-required message vs a generic fallback."
        }
      ]
    }
  ]
}