{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Harden frontend initialization: optional admin-token init, clearer InitError UX, and health-check based diagnostics",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make admin-token initialization optional/non-fatal and convert invalid-token failures into explicit initialization errors.",
      "acceptanceCriteria": [
        "When no caffeineAdminToken is present, the app does not throw during actor initialization.",
        "When caffeineAdminToken is present but invalid, the app shows a clear error state (InitErrorScreen) instead of hanging or crashing.",
        "`frontend/src/hooks/useActor.ts` no longer calls `_initializeAccessControlWithSecret` with an empty string token.",
        "`frontend/src/hooks/useLocalActor.ts` treats `_initializeAccessControlWithSecret` errors as initialization errors with a sanitized message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Harden authenticated actor initialization by making admin-token initialization optional: only call the authorization component’s `_initializeAccessControlWithSecret` when `getSecretParameter('caffeineAdminToken')` returns a non-empty, trimmed token; never pass an empty string. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useLocalActor.ts",
          "operation": "modify",
          "description": "Treat admin-token initialization as optional and non-fatal for missing/empty tokens, but convert invalid-token failures into a clean `initError` state: when `_initializeAccessControlWithSecret` rejects, set `initError` to a sanitized Error (no secrets) and ensure `actor` is cleared so the app reliably renders InitErrorScreen. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/init/sanitizeInitError.ts",
          "operation": "modify",
          "description": "Add a reusable sanitization helper that can produce a safe Error object/message for storing in init state (redacting tokens/secrets), so hooks can set `initError` without leaking sensitive values. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Improve InitErrorScreen messaging and recovery flows for authorization/token vs network initialization failures.",
      "acceptanceCriteria": [
        "InitErrorScreen displays an English summary that distinguishes authorization/token failures from network failures using the existing `sanitizeInitError` mechanism.",
        "If the sanitized error indicates authorization failure, the screen includes user-facing guidance in English (e.g., that access is not authorized and the user may need to retry or reset local data) without exposing any secrets.",
        "Retry and Reset actions remain functional and do not leave the app stuck on an indefinite “Initializing...” state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/init/sanitizeInitError.ts",
          "operation": "modify",
          "description": "Extend `sanitizeInitError` to return an explicit, frontend-usable classification (e.g., `kind: 'authorization' | 'network' | 'timeout' | 'unknown'`) derived from the sanitized message, while keeping summaries/technical details secret-safe. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/init/InitErrorScreen.tsx",
          "operation": "modify",
          "description": "Update the InitErrorScreen UI (using existing shadcn-ui components like Card/Alert/Collapsible/Button) to (1) show an English summary that clearly differentiates authorization/token failures vs network failures via the enhanced `sanitizeInitError`, and (2) conditionally render additional English guidance for authorization/token failures (retry/reset suggestions) without exposing secrets. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure Retry/Reset flows can always transition out of the loading state by keeping `isRetrying` strictly tied to the async handlers and relying on `useLocalActor` to set `isFetching`/`initError` deterministically after retries/resets (no indefinite “Initializing...” regressions). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Use a permissionless health-check during initialization to distinguish unreachable-canister failures from authorization/token failures.",
      "acceptanceCriteria": [
        "Backend exposes a new query method (e.g., `health()`/`ping()`) that returns a simple value and does not require `#user` permission.",
        "`useLocalActor` (or the main initialization flow in `App.tsx`) calls the health-check after actor creation and surfaces failures via `initError` so the InitErrorScreen appears instead of the UI proceeding into broken/unauthorized states.",
        "With the canister reachable, initialization proceeds past the loading screen; with the canister unreachable, the user sees InitErrorScreen with a network-related summary."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLocalActor.ts",
          "operation": "modify",
          "description": "After `createActorWithConfig` returns, call the backend health-check capability (`actor.checkHealth()` per `frontend/src/backend.d.ts`) before attempting any token-based access-control initialization; on failure, set `initError` (sanitized) so InitErrorScreen shows a network-related summary; on success, proceed with optional admin-token initialization and then set `actor`. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/features/init/sanitizeInitError.ts",
          "operation": "modify",
          "description": "Map health-check failures into the network-related classification/summary path (via sanitized message matching), so the InitErrorScreen reliably shows a network-related summary when the canister is unreachable. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}