{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Repair production WebRTC call signaling and improve frontend call diagnostics",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure a single RTCPeerConnection per call is used end-to-end (offer creation + answer application) and align frontend signaling lifecycle so calls connect and end cleanly.",
      "acceptanceCriteria": [
        "From a 1:1 chat thread, User A can start a voice call to User B and the call transitions from initiated/ringing to inProgress after User B accepts.",
        "The SDP offer generated by the caller is stored on the backend call session and is the offer used by the callee to create an answer.",
        "When the callee answers (answer SDP stored on backend), the caller applies that answer on the same RTCPeerConnection that created the offer (no mismatched peer connections).",
        "If the call is ended by either party, the backend call status becomes ended and both clients exit the call UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/chat/MessageThread.tsx",
          "operation": "modify",
          "description": "Refactor outgoing call initiation so the chat thread no longer creates a throwaway RTCPeerConnection/SDP offer. Instead, trigger the call UI with enough intent (callee + kind) for the in-call layer to create the RTCPeerConnection, generate the offer, and start the backend call session from the same connection. Continue using existing toast patterns for user feedback. Verify the component's usage instructions before implementing (shadcn-ui Button)."
        },
        {
          "path": "frontend/src/features/calls/CallProvider.tsx",
          "operation": "modify",
          "description": "Adjust global call state to support an outgoing call that begins in a 'pre-session' state (before callId exists) and to store the active RTCPeerConnection in reactive state (not only a ref) so CallScreen and other UI reliably share the same connection instance for the entire call. Ensure cleanup closes the correct connection and resets state on end. Verify the component's usage instructions before implementing (shadcn-ui usage via existing call UI composition)."
        },
        {
          "path": "frontend/src/features/calls/CallScreen.tsx",
          "operation": "modify",
          "description": "Move outgoing WebRTC setup to: (1) create exactly one RTCPeerConnection, (2) add local tracks, (3) generate and persist the SDP offer via backend startCall, (4) store the resulting callId into CallProvider state, and (5) later apply the SDP answer to that same RTCPeerConnection. Remove/replace the existing logic that polls for an answer using a callSession that can be stale relative to the created PC, and avoid creating a second PC. Also ensure incoming calls reuse the RTCPeerConnection created during accept (from CallProvider state) and that remote media streams are wired consistently. Verify the component's usage instructions before implementing (shadcn-ui Button/Avatar)."
        },
        {
          "path": "frontend/src/features/calls/IncomingCallManager.tsx",
          "operation": "modify",
          "description": "On accept, ensure the callee creates exactly one RTCPeerConnection, uses the backend-stored offer to create an answer, persists the answer, and then hands off the same RTCPeerConnection to CallProvider so CallScreen uses it (no second PC). Ensure remote stream handling is passed through to CallScreen state (not just console logging) and that decline/end transitions clear dialog + exit call UI when status ends/missed. Verify the component's usage instructions before implementing (shadcn-ui AlertDialog/Button in IncomingCallDialog)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Surface actionable call/signaling and permission failures in the UI and console without modifying immutable hook/UI paths.",
      "acceptanceCriteria": [
        "If startCall/answerCall/updateCallStatus/getCallSession/getPendingIncomingCalls fail, the UI surfaces an English error message (toast or in-call error screen) and logs the underlying error to console for debugging.",
        "If microphone/camera permissions are denied, the call UI displays a clear error state and offers an End Call action.",
        "No changes are made to frontend immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/features/calls/useCallSignaling.ts",
          "operation": "modify",
          "description": "Extend signaling polling to expose a stable error state (in addition to logging) when getCallSession fails or returns unusable data for the current flow (e.g., missing offer/answer when required). Keep console.error for underlying error details and provide a message the UI can display. Verify the component's usage instructions before implementing (shadcn-ui toast usage via existing Toaster integration)."
        },
        {
          "path": "frontend/src/features/calls/useIncomingCallPolling.ts",
          "operation": "modify",
          "description": "Add robust error handling around getPendingIncomingCalls so failures are logged and also surfaced to the user via an English toast/message (without spamming—dedupe or throttle within the hook). Verify the component's usage instructions before implementing (shadcn-ui toast usage via existing Toaster integration)."
        },
        {
          "path": "frontend/src/features/calls/CallScreen.tsx",
          "operation": "modify",
          "description": "Add user-visible error states for (a) backend signaling failures (startCall/updateCallStatus/getCallSession), (b) missing/invalid offer/answer, and (c) WebRTC state failures (setRemoteDescription/addTrack issues). Ensure errors show an English message (toast and/or existing in-call error screen) and always provide an End Call action. Log the underlying error objects to console for production diagnosis. Verify the component's usage instructions before implementing (shadcn-ui Button/Avatar)."
        },
        {
          "path": "frontend/src/features/calls/IncomingCallManager.tsx",
          "operation": "modify",
          "description": "Improve accept/decline failure visibility: if answerCall/updateCallStatus/getUserMedia fails, show an English toast and log the underlying error to console; keep the incoming dialog/call UI consistent (do not leave the app stuck in a ringing state). Verify the component's usage instructions before implementing (shadcn-ui AlertDialog/Button in IncomingCallDialog)."
        },
        {
          "path": "frontend/src/features/calls/CallChip.tsx",
          "operation": "modify",
          "description": "When ending a call from the minimized chip, surface backend updateCallStatus failures via an English toast while still exiting the call UI locally, and log the underlying error to console. Verify the component's usage instructions before implementing (shadcn-ui Button)."
        }
      ]
    }
  ]
}